<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta content="text/html; charset=UTF-8" http-equiv="content-type">
    <link rel="stylesheet" type="text/css" href="style.css">

    <title>Document</title>
</head>



    <body class="c15 c29 doc-content">
        <p class="c22"><span
             class="c7">Linguagens Nativas e Linguagens H&iacute;bridas</span></p><p
              class="c22"><span 
    style="overflow: hidden; display: inline-block; margin: 5.00px 5.00px; border: 5.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad)
     translateZ(0px); width: 630.44px; height: 268.05px;"><img alt="" src="images/image1.png" style="width: 630.44px; height: 268.05px; margin-left: .00px; margin-top: .00px;
      transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c4"><span class="c7"></span></p><p 
      class="c22"><span class="c7">Lara Pires &amp; Abdaisy Concei&ccedil;&atilde;o</span></p><p
       class="c22"><span class="c7">PI 1</span></p><p class="c18"><span class="c7"></span></p><p
        class="c18"><span class="c7"></span></p><p
     class="c4"><span class="c7"></span></p><p 
     class="c6"><span class="c16">Linguagens h&iacute;bridas</span><span 
     class="c23">&nbsp;(</span><span class="c24">&nbsp;s&atilde;o as linguagens que s&atilde;o compiladas e interpretadas.)</span></p><p class="c4"><span
         class="c5"></span></p><p class="c6"><span class="c2">A linguagem h&iacute;brida &eacute; uma linguagem de programa&ccedil;&atilde;o que combina caracter&iacute;sticas e funcionalidades de diferentes tipos de linguagens. </span></p><p 
         class="c4"><span class="c2"></span></p><p class="c6"><span 
            class="c2">O m&eacute;todo h&iacute;brido, representa um meio termo entre os compiladores e os int&eacute;rpretes. Ele traduz (compila) os programas em linguagem de alto n&iacute;vel para uma linguagem intermedi&aacute;ria projetada para facilitar a interpreta&ccedil;&atilde;o. </span></p><p 
            class="c4"><span class="c2"></span></p><p 
            class="c6"><span class="c1 c20"><br>Exemplo de linguagens H&iacute;bridas:</span></p><ul class="c3 lst-kix_b3aegodjj7hf-1 start"><li class="c10 c6 li-bullet-0"><span class="c2">JavaScript </span></li><li 
                class="c6 c10 li-bullet-0"><span
                 class="c2">Dart </span></li><li 
                 class="c10 c6 li-bullet-0"><span 
                 class="c2">C#</span></li><li
                  class="c10 c6 li-bullet-0"><span 
                  class="c2">Java</span></li><li class="c10 c6 li-bullet-0"><span class="c2">HTML, CSS e JavaScript</span></li></ul><p class="c4"><span class="c1 c20"></span></p><h3 class="c9" id="h.7mv29spn93qf"><span
                     class="c8">Linguagens H&iacute;bridas em Desenvolvimento de Aplicativos M&oacute;veis:</span></h3><ul class="c3 lst-kix_b3aegodjj7hf-0 start"><li class="c11 c6 c15 li-bullet-0"><span 
                        class="c2">JavaScript (com React Native, NativeScript, Ionic):</span></li></ul><ul class="c3 lst-kix_b3aegodjj7hf-1 start"><li class="c10 c6 li-bullet-0"><span
                             class="c2">Permite o desenvolvimento de aplicativos para iOS e Android usando JavaScript.</span></li><li class="c10 c6 li-bullet-0"><span class="c2">Oferece reutiliza&ccedil;&atilde;o de c&oacute;digo e acesso a recursos nativos.</span></li></ul><ul class="c3 lst-kix_b3aegodjj7hf-0"><li class="c11 c6 c15 li-bullet-0"><span class="c2">Dart (com Flutter):</span></li></ul><ul class="c3 lst-kix_b3aegodjj7hf-1 start"><li class="c10 c6 li-bullet-0"><span 
                                class="c2">Utiliza o Flutter para criar aplicativos nativos para iOS, Android e Web a partir de um &uacute;nico c&oacute;digo-fonte em Dart.</span></li><li 
                                class="c10 c6 li-bullet-0"><span
                                 class="c2">Destaca-se pela rapidez de desenvolvimento e desempenho.</span></li></ul><p class="c4"><span class="c2"></span></p><p class="c4"><span class="c2"></span></p><h3 
                                 class="c9" id="h.o90a9htfy7a1"><span 
                                 class="c20 c26 c15">Vantagens das Linguagens H&iacute;bridas:</span></h3><ul class="c3 lst-kix_but6qm16x3gz-0 start"><li class="c11 c6 li-bullet-0"><span
                                     class="c1">Reutiliza&ccedil;&atilde;o de C&oacute;digo</span><span class="c17 c15">: As linguagens h&iacute;bridas permitem que os desenvolvedores </span><span
                                      class="c15 c17">reutilizem</span><span
                                       class="c2">&nbsp;uma grande parte do c&oacute;digo em diferentes plataformas, o que reduz significativamente o esfor&ccedil;o de desenvolvimento e o tempo de lan&ccedil;amento.</span></li><li
                                        class="c11 c6 li-bullet-0"><span 
                                        class="c1">Acesso a Recursos Nativos:</span><span
                                         class="c2">&nbsp;Embora n&atilde;o sejam totalmente nativas, muitas linguagens h&iacute;bridas oferecem acesso &agrave;s APIs nativas por meio de plugins ou wrappers, permitindo que os desenvolvedores integrem funcionalidades espec&iacute;ficas de cada plataforma quando necess&aacute;rio.</span></li><li
                                          class="c11 c6 li-bullet-0"><span 
                                          class="c1">R&aacute;pido Desenvolvimento e Prototipagem:</span><span
                                           class="c17 c15">&nbsp;Gra&ccedil;as &agrave; sua abordagem de desenvolvimento &uacute;nico e &agrave; disponibilidade de ferramentas de desenvolvimento eficientes, as linguagens </span><span 
                                           class="c2">h&iacute;bridas s&atilde;o ideais para prototipagem r&aacute;pida e intera&ccedil;&atilde;o &aacute;gil.</span></li><li class="c6 c11 li-bullet-0"><span 
                                            class="c1">Comunidade Ativa e Suporte</span><span 
                                            class="c2">: Muitas linguagens h&iacute;bridas t&ecirc;m comunidades de desenvolvedores ativas e uma ampla gama de recursos de aprendizado dispon&iacute;veis, incluindo documenta&ccedil;&atilde;o detalhada, f&oacute;runs de discuss&atilde;o e tutoriais.</span></li></ul><h3 class="c9" id="h.kbhgkc9b4ocm"><span 
                                                class="c20 c15 c26">Desvantagens das Linguagens H&iacute;bridas:</span></h3><ul 
                                            class="c3 lst-kix_ut50tcgsbpvf-0 start"><li
                                             class="c11 c6 li-bullet-0"><span 
                                             class="c1">Desempenho Limitado</span><span 
                                             class="c2">: Embora tenham melhorado significativamente ao longo dos anos, os aplicativos desenvolvidos com linguagens h&iacute;bridas podem enfrentar desafios de desempenho em compara&ccedil;&atilde;o com aplicativos nativos, especialmente em cen&aacute;rios de alta demanda computacional.</span></li><li
                                              class="c11 c6 li-bullet-0"><span
                                               class="c1">Limita&ccedil;&otilde;es de Acesso a Recursos Nativos:</span><span 
                                               class="c2">&nbsp;Mesmo com acesso a APIs nativas, algumas funcionalidades avan&ccedil;adas podem ser dif&iacute;ceis de implementar ou podem n&atilde;o ter suporte total em linguagens h&iacute;bridas, o que pode limitar a capacidade de desenvolver determinados tipos de aplicativos.</span></li><li
                                                class="c11 c6 li-bullet-0"><span
                                                 class="c1">Depend&ecirc;ncia de Frameworks</span><span
                                                  class="c2">: Muitas linguagens h&iacute;bridas dependem de frameworks espec&iacute;ficos, o que pode limitar a flexibilidade e a portabilidade do c&oacute;digo em alguns casos.</span></li><li 
                                                  class="c11 c6 li-bullet-0"><span
                                                   class="c1">Curva de Aprendizado:</span><span 
                                                   class="c2">&nbsp;Para os desenvolvedores acostumados com linguagens nativas, pode haver uma curva de aprendizado ao trabalhar com linguagens h&iacute;bridas e seus respectivos frameworks.</span></li></ul><p 
                                                   class="c4 c27"><span 
                                                   class="c2"></span></p><p 
                                                   class="c14 c21"><span 
                                                   class="c2">No geral, as linguagens h&iacute;bridas oferecem uma abordagem interessante para o desenvolvimento de aplicativos m&oacute;veis, equilibrando a efici&ecirc;ncia do desenvolvimento com a capacidade de fornecer experi&ecirc;ncias de usu&aacute;rio de alta qualidade em v&aacute;rias plataformas. A escolha entre linguagens h&iacute;bridas e nativas geralmente depende das necessidades espec&iacute;ficas do projeto, das habilidades da equipe de desenvolvimento e das considera&ccedil;&otilde;es de desempenho e escalabilidade.</span></p><p
                                                    class="c4"><span class="c2"></span></p><p 
                                                    class="c18"><span class="c5"></span></p><p 
                                                    class="c4"><span class="c5"></span></p><p 
                                                    class="c6"><span
                                                     class="c12">Linguagens de Programa&ccedil;&atilde;o Nativas</span></p><p
                                                      class="c14 c6"><span
                                                       class="c2">Linguagens de Programa&ccedil;&atilde;o Nativas s&atilde;o linguagens de programa&ccedil;&atilde;o que s&atilde;o diretamente suportadas pelo hardware ou pelo sistema operacional de um dispositivo. Isso significa que essas linguagens podem ser compiladas diretamente para o c&oacute;digo de m&aacute;quina execut&aacute;vel pelo processador, sem a necessidade de uma camada de tradu&ccedil;&atilde;o adicional, como um interpretador ou uma m&aacute;quina virtual.</span></p><p
                                                        class="c14 c6"><span 
                                                        class="c2">Essas linguagens normalmente oferecem um alto desempenho e acesso direto aos recursos do sistema, o que as torna ideais para o desenvolvimento de software que requer efici&ecirc;ncia m&aacute;xima, como sistemas operacionais, drivers de dispositivos e aplicativos de sistema.</span></p><p
                                                         class="c6"><span 
                                                         class="c1 c28">Exemplos comuns de linguagens de programa&ccedil;&atilde;o nativas:</span></p><ul class="c3 lst-kix_v5qjfh5a8h6h-0 start"><li
                                                             class="c11 c13 li-bullet-0"><span 
                                                             class="c1">C: </span><span 
                                                             class="c2">C &eacute; uma linguagem de programa&ccedil;&atilde;o de prop&oacute;sito geral que &eacute; amplamente utilizada para desenvolver sistemas operacionais, drivers de dispositivos, aplicativos de sistema e muito mais. &Eacute; conhecida por seu alto desempenho e controle de baixo n&iacute;vel.</span></li><li
                                                              class="c11 c13 li-bullet-0"><span 
                                                              class="c1">C + +:</span><span
                                                               class="c2">&nbsp;C + + &eacute; uma extens&atilde;o da linguagem C que adiciona recursos como programa&ccedil;&atilde;o orientada a objetos. &Eacute; usado para desenvolvimento de software de alto desempenho, como jogos, aplicativos de desktop e sistemas embarcados.</span></li><li
                                                                class="c11 c13 li-bullet-0"><span 
                                                                class="c1">Rust:</span><span 
                                                                class="c2">&nbsp;Rust &eacute; uma linguagem de programa&ccedil;&atilde;o relativamente nova que combina alto desempenho com seguran&ccedil;a de mem&oacute;ria e preven&ccedil;&atilde;o de erros de programa&ccedil;&atilde;o. &Eacute; frequentemente usado em sistemas que exigem alta seguran&ccedil;a e desempenho, como navegadores da web e sistemas operacionais.</span></li><li 
                                                                class="c11 c13 li-bullet-0"><span
                                                                 class="c1">Assembly: </span><span 
                                                                 class="c2">Assembly &eacute; uma linguagem de baixo n&iacute;vel que representa diretamente as instru&ccedil;&otilde;es do processador. Embora seja muito poderosa e permita um controle do hardware, &eacute; complexa e geralmente usada apenas em situa&ccedil;&otilde;es onde o desempenho m&aacute;ximo &eacute; necess&aacute;rio.</span></li><li class="c11 c13 li-bullet-0"><span 
                                                                    class="c1">Objective-C e Swift:</span><span 
                                                                    class="c2">&nbsp;S&atilde;o linguagens usadas para desenvolvimento de aplicativos em plataformas da Apple, como iOS. Objective-C tem sido historicamente usado, enquanto Swift &eacute; uma linguagem mais moderna desenvolvida pela Apple.</span></li></ul><p 
                                                                    class="c0"><span 
                                                                        class="c2"></span></p><p 
                                                                        class="c6 c14"><span class="c8">Vantagens:</span></p><ul
                                                                         class="c3 lst-kix_mcr0nub6kky6-0 start"><li class="c11 c6 c15 li-bullet-0"><span
                                                                             class="c1">Alto desempenho:</span><span 
                                                                             class="c2">&nbsp;As linguagens nativas s&atilde;o compiladas diretamente para c&oacute;digo de m&aacute;quina, o que geralmente resulta em um desempenho mais eficiente em compara&ccedil;&atilde;o com linguagens interpretadas ou que utilizam uma m&aacute;quina virtual.</span></li><li class="c11 c6 c15 li-bullet-0"><span 
                                                                                class="c1">Acesso direto ao hardware:</span><span 
                                                                                class="c2">&nbsp;As linguagens nativas geralmente oferecem acesso direto aos recursos de hardware do sistema, permitindo um controle preciso e eficiente sobre esses recursos. Isso &eacute; especialmente importante para o desenvolvimento de sistemas operacionais, drivers de dispositivos e aplicativos de baixo n&iacute;vel.</span></li><li 
                                                                                class="c11 c6 c15 li-bullet-0"><span 
                                                                                class="c1">Controle de baixo n&iacute;vel:</span><span 
                                                                                class="c2">&nbsp;As linguagens nativas permitem um controle detalhado e de baixo n&iacute;vel sobre o sistema, o que pode ser &uacute;til para otimiza&ccedil;&atilde;o de desempenho e manipula&ccedil;&atilde;o de recursos de hardware espec&iacute;ficos.</span></li><li
                                                                                 class="c11 c6 c15 li-bullet-0"><span 
                                                                                 class="c1">Portabilidade:</span><span
                                                                                  class="c2">&nbsp;Embora as linguagens nativas geralmente sejam espec&iacute;ficas para uma arquitetura de processador ou sistema operacional, muitas delas s&atilde;o port&aacute;veis e podem ser compiladas para diferentes plataformas com poucas modifica&ccedil;&otilde;es.</span></li></ul><p class="c0 c19"><span
                                                                                     class="c2"></span></p><p class="c0"><span 
                                                                                        class="c8"></span></p><p class="c0"><span 
                                                                                            class="c8"></span></p><p class="c14 c6"><span
                                                                                                 class="c8">Desvantagens:</span></p><ul 
                                                                                                 class="c3 lst-kix_mhaqsnux9ktq-0 start"><li
                                                                                                  class="c11 c6 c15 li-bullet-0"><span 
                                                                                                  class="c1">Complexidade:</span><span 
                                                                                                  class="c2">&nbsp;Linguagens nativas como C e C + + tendem a ser mais complexas e dif&iacute;ceis de aprender e usar em compara&ccedil;&atilde;o com linguagens de n&iacute;vel mais alto. Elas exigem um entendimento mais profundo de conceitos de baixo n&iacute;vel e podem ser propensas a erros de programa&ccedil;&atilde;o mais sutis, como vazamentos de mem&oacute;ria e ponteiros inv&aacute;lidos.</span></li><li class="c11 c6 c15 li-bullet-0"><span
                                                                                                     class="c1">Gerenciamento manual de mem&oacute;ria:</span><span
                                                                                                      class="c2">&nbsp;Muitas linguagens nativas exigem que o programador gerencie manualmente a aloca&ccedil;&atilde;o e desaloca&ccedil;&atilde;o de mem&oacute;ria, o que pode levar a erros de programa&ccedil;&atilde;o, como vazamentos de mem&oacute;ria ou corrup&ccedil;&atilde;o de dados.</span></li><li
                                                                                                       class="c11 c6 c15 li-bullet-0"><span
                                                                                                        class="c1">Falta de recursos abstratos:</span><span 
                                                                                                        class="c2">&nbsp;Em compara&ccedil;&atilde;o com linguagens de alto n&iacute;vel, as linguagens nativas podem exigir mais trabalho manual para realizar tarefas comuns, como manipula&ccedil;&atilde;o de strings e cole&ccedil;&otilde;es de dados. Isso pode resultar em c&oacute;digo mais verboso e propenso a erros.</span></li><li 
                                                                                                        class="c11 c6 c15 li-bullet-0"><span 
                                                                                                        class="c1">Depura&ccedil;&atilde;o mais complexa:</span><span
                                                                                                         class="c2">&nbsp;O baixo n&iacute;vel de abstra&ccedil;&atilde;o das linguagens nativas pode tornar a depura&ccedil;&atilde;o de c&oacute;digo mais complexa e demorada, especialmente em sistemas grandes e complexos.</span></li></ul><p 
                                                                                                         class="c27 c4"><span 
                                                                                                         class="c2"></span></p>
                                                                                                        
                                                                                                        
                                                                                                        </body>
                                                                                                        
                                                                                                        </html>